---
kind: type
id: T:Autodesk.Revit.DB.StringParameterValue
source: html/2f79fff4-9773-471a-83f8-5636459bdbe5.htm
---
# Autodesk.Revit.DB.StringParameterValue

A class that holds a String value of a parameter element.

## Syntax (C#)
```csharp
public class StringParameterValue : ParameterValue
```